{
  "spec_version": "2.1",
  "id": "bundle--ab0bcc5c-c881-4ec3-a902-a4ce36c670b8",
  "type": "bundle",
  "objects": [
{
      "name": "Nounou Mbeiri",
      "description": "MITRE ATT&CK Defender (MAD) | Cyber Threat Intelligence researcher | Collaborator in Cyber Threat Intelligence community (GINSEG) | Public Speaking",
      "identity_class": "individual",
      "contact_information": "Twitter: @Nounou_Mbeiri",
      "id": "identity--1dd7bca6-cef5-4395-826f-64994241b3cf",
      "type": "identity",
      "spec_version": "2.1",
      "created": "2021-03-10T10:00:00.000Z",
      "modified": "2021-03-10T10:00:00.000Z"
    },
    {
      "name": "CleanUpLoader | Oyster Backdoor",
      "description": "CleanUpLoader, also known as Oyster or Broomstick, is a sophisticated backdoor malware written in C++, first identified in July 2023 by IBM researchers. This malware is typically delivered through fake software installers, such as those for Microsoft Teams or Google Chrome.\n\nThe malware leverages legitimate digital certificates issued to organizations like Shanxi Yanghua Furnishings and Shantou Chenghai Rongsheng to bypass security measures, presenting itself as a trusted application during the initial infection phase.\n\nOnce installed, CleanUpLoader establishes communication with command-and-control (C2) servers via HTTPS, using HTTP POST requests to specific endpoints like /api/connectivity, /api/session, and /api/connect, allowing attackers to maintain persistence, gather information, and exfiltrate data.",
      "published": "2024-10-13T13:25:24+01:00",
      "id": "report--c71e0faf-401f-4136-8ccb-fa566e8a61d8",
      "type": "report",
      "spec_version": "2.1",
      "created_by_ref": "identity--1dd7bca6-cef5-4395-826f-64994241b3cf",
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
      "report_types": [
        "malware"
      ],
      "object_refs": [
        "malware--edd99695-8766-44d7-9de5-9b1451de0f8a"
      ],
      "external_references": [
        {
          "source_name": "CTI-Driven",
          "url": "https://github.com/CTI-Driven/Advanced-Threat-Hunting-Ransomware-Groups/tree/main/Arsenals/CleanUpLoader"
        }
      ]
    },
    {
      "id": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "type": "malware",
      "spec_version": 2.1,
      "labels": [],
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",

      "external_references": [
        {
          "source_name": "",
          "url": "https://malpedia.caad.fkie.fraunhofer.de/details/win.broomstick"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "aliases": [
        "Oyster Backdoor",
        "CLEANBOOST",
        "CleanUp",
        "Broomstick"
      ],
      "first_seen": "2024-10-13T13:25:24+01:00",
      "last_seen": "2024-10-13T13:25:24+01:00",
      "operating_system_refs": [],
      "architecture_execution_envs": [],
      "implementation_languages": [
        "c++"
      ],
      "capabilities": [
        "communicates-with-c2",
        "installs-other-components",
        "persists-after-system-reboot"
      ],
      "sample_refs": [],
      "malware_types": [
        "backdoor"
      ],
      "name": "CleanUpLoader",
      "description": "Oyster is a backdoor malware written in C++, first appearing in July 2023. It allows for remote sessions, supporting tasks like file transfer and command-line processing. This malware has been used by numerous threat actors as a tool to support ransomware intrusions. The distribution of Oyster has most likely been spread through various methods, which is suggested by the build identifiers in examined samples. Additionally, Oyster is capable of collecting basic system data and communicates with a command-and-control server (C2). It can execute commands via cmd.exe and run additional files.",
      "kill_chain_phases": [
        {
          "kill_chain_name": "lockheed-martin-cyber-kill-chain",
          "phase_name": "command-and-control"
        },
        {
          "kill_chain_name": "lockheed-martin-cyber-kill-chain",
          "phase_name": "installation"
        },
        {
          "kill_chain_name": "lockheed-martin-cyber-kill-chain",
          "phase_name": "exploitation"
        }
      ]
    },
    {
      "id": "sighting--3d58287e-5afc-4ad4-9564-3782e9fa1c87",
      "type": "sighting",
      "spec_version": 2.1,
      "labels": [],
      "created": "2024-10-15T18:54:46+01:00",
      "modified": "2024-10-15T18:54:46+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "description": "A true positive would involve the following:\n\n-> schtasks.exe /create /tn ClearMngs /tr \"rundll32 '<location of binary>\\CleanUp30.dll',Test\" /sc hourly /mo 3 /f\n\n-> powershell.exe -Command \"$ws -New-Object -ComObject WScript.Shell; $s - $ws.CreateShortcut ('C:\\Users\\<User>\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\DiskCleanUp.1nk'); $s.TargetPath 'C:\\Users\\<User>\\AppData\\Local\\Temp\\CleanUp.dll, Test'; $s.Save()\n\n-> HTTP connection established to the domain \"supfoundrysettlers[.]us\" by the file \"CleanUp30.dll,\"\n\n-> C2 connection to the IP address \"195.85.114[.]193\" over ports 4288, 4043, and 777\n\n-> HTTP POST requests to /api/connectivity, /api/session, and /api/connect used by CleanUpLoader\n\n-> Commands intended to gather information on the compromised host and domain environment, such as \"whoami.exe,\" \"net1 group 'domain computers' /domain,\" \"nltest.exe /domain_trusts,\" and \"tasklist.exe\"\n\n-> HTTP POST requests to endpoints like /api/connectivity, /api/session, and /api/connect used by CleanUpLoader",
      "first_seen": "2024-10-15T18:54:46+01:00",
      "last_seen": "2024-10-15T18:54:46+01:00",
      "sighting_of_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a"
    },
    {
      "id": "indicator--6a9dbe65-b8fb-44c2-9844-97540c9168d2",
      "type": "indicator",
      "spec_version": 2.1,
      "labels": [],
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",

      "external_references": [
        {
          "source_name": "",
          "url": "https://bazaar.abuse.ch/browse/signature/CleanUpLoader/"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "indicator_types": [
        "compromised"
      ],
      "name": " 2b62dd154b431d8309002d5b4a35de07 ",
      "description": "Oyster is a backdoor malware written in C++, first appearing in July 2023. It allows for remote sessions, supporting tasks like file transfer and command-line processing. This malware has been used by numerous threat actors as a tool to support ransomware intrusions. The distribution of Oyster has most likely been spread through various methods, which is suggested by the build identifiers in examined samples. Additionally, Oyster is capable of collecting basic system data and communicates with a command-and-control server (C2). It can execute commands via cmd.exe and run additional files.",
      "pattern": "rule mal_cleanuploader {\n    meta:\n        description = \"Detects CleanUpLoader\"\n        author = \"RussianPanda\"\n        date = \"2024-02-14\"\n        reference = \"https://x.com/AnFam17/status/1757871703282077857?s=20\"\n        hash = \"2b62dd154b431d8309002d5b4a35de07\"\n    strings:\n        $s1 = {0F B6 80 30 82 42 00 88}\n        $s2 = {44 69 73 6B 43 6C 72}\n        $s3 = {49 00 6E 00 73 00 74 00 61 00 6C 00 6C 00 20 00 45 00 64 00 67 00 65}\n    condition:\n        uint16(0) == 0x5A4D and all of them and #s1 > 15\n}",
      "pattern_type": "yara",
      "pattern_version": "",
      "valid_from": "2024-10-13T13:25:24+01:00",
      "valid_until": "2024-10-13T13:25:24+01:00",
      "kill_chain_phases": [
        {
          "kill_chain_name": "lockheed-martin-cyber-kill-chain",
          "phase_name": "installation"
        }
      ]
    },
    {
      "id": "threat-actor--36924446-8ac0-47a3-a618-29e0aa134148",
      "type": "threat-actor",
      "spec_version": 2.1,
      "labels": [],
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://app.tidalcyber.com/groups/0610cd57-2511-467a-97e3-3c810384074f"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "threat_actor_types": [],
      "name": "Rhysida Ransomware Actors",
      "description": "This object represents the behaviors associated with operators of Rhysida ransomware, which is licensed on a ransomware-as-a-service (\"RaaS\") basis. Various affiliated ransomware operators likely do not operate as a cohesive unit. The Rhysida RaaS operation has been active since May 2023, claiming attacks on multiple sectors in several countries in North and South America, Western Europe, and Australia. Many alleged victims are education sector entities. Security researchers have observed TTP and victimology overlaps with the Vice Society extortion group.[HC3 Analyst Note Rhysida Ransomware August 2023]\n\nRelated Vulnerabilities: CVE-2020-1472[U.S. CISA Rhysida Ransomware November 15 2023]",
      "aliases": [],
      "roles": [],
      "goals": [
        "Financial Gain"
      ],
      "first_seen": "2024-10-13T13:25:24+01:00",
      "last_seen": "2024-10-13T13:25:24+01:00",
      "sophistication": "advanced",
      "resource_level": "",
      "primary_motivation": "",
      "secondary_motivations": [],
      "personal_motivations": []
    },
    {
      "id": "course-of-action--80412f82-96ff-4597-bffc-64a16a115244",
      "type": "course-of-action",
      "spec_version": 2.1,
      "labels": [],
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://github.com/RussianPanda95/Yara-Rules/blob/main/CleanUpLoader/mal_cleanuploader.yar"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "name": "Yara-Rules",
      "description": "Yara rule to detect CleanUpLoader:\n\nrule mal_cleanuploader {\n    meta:\n        description = \"Detects CleanUpLoader\"\n        author = \"RussianPanda\"\n        date = \"2024-02-14\"\n        reference = \"https://x.com/AnFam17/status/1757871703282077857?s=20\"\n        hash = \"2b62dd154b431d8309002d5b4a35de07\"\n    strings:\n        $s1 = {0F B6 80 30 82 42 00 88}\n        $s2 = {44 69 73 6B 43 6C 72}\n        $s3 = {49 00 6E 00 73 00 74 00 61 00 6C 00 6C 00 20 00 45 00 64 00 67 00 65}\n    condition:\n        uint16(0) == 0x5A4D and all of them and #s1 > 15\n}"
    },
    {
      "id": "course-of-action--d135ec7d-053e-47e2-8ff1-6ac39b4c2f08",
      "type": "course-of-action",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
      "name": "(KQL) Advanced Hunting Query",
      "description": "// Replace \"Timestamp\" with \"TimeGenerated\" when running this KQL query in Microsoft Sentinel.\n\n//Comment: A true positive would involve the following:\n//-> schtasks.exe /create /tn ClearMngs /tr \"rundll32 '<location of binary>\\CleanUp30.dll',Test\" /sc hourly /mo 3 /f\n//-> powershell.exe -Command \"$ws -New-Object -ComObject WScript.Shell; $s - $ws.CreateShortcut ('C:\\Users\\<User>\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\DiskCleanUp.1nk'); $s.TargetPath 'C:\\Users\\<User>\\AppData\\Local\\Temp\\CleanUp.dll, Test'; $s.Save()\n//-> HTTP connection established to the domain \"supfoundrysettlers[.]us\" by the file \"CleanUp30.dll,\"\n//-> //-> C2 connection to the IP address \"195.85.114[.]193\" over ports 4288, 4043, and 777\n//-> HTTP POST requests to /api/connectivity, /api/session, and /api/connect used by CleanUpLoader\n//-> Commands intended to gather information on the compromised host and domain environment, such as \"whoami.exe,\" \"net1 group 'domain computers' /domain,\" \"nltest.exe /domain_trusts,\" and \"tasklist.exe\"\n//-> HTTP POST requests to endpoints like /api/connectivity, /api/session, and /api/connect used by CleanUpLoader\n//References:\n//   - https://www.reliaquest.com/blog/5-malware-variants-you-should-know/\n//    - https://go.recordedfuture.com/hubfs/reports/cta-2024-1009.pdf\n//    - https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/\n//    - https://app.any.run/tasks/aa15e125-38b8-44d8-add9-54e21e6813bb\n//\n//QKL Advanced hunting query:\nlet timeframe = 24hr;\n// Detection 1: Valid digital certificates used by CleanUpLoader\nlet ValidDigitalCertificates = (\n    DeviceProcessEvents\n    | where Timestamp >= ago(timeframe)\n    | invoke FileProfile()\n    | where Signer has_all (\"Shanxi\",\"Yanghua\",\"Furnishings\") or Signer has_all (\"Shantou\",\"Chenghai\",\"Rongsheng\")\n);\n// Detection 2: C2 HTTP POST requests Linked to CleanUpLoader\nlet C2HttpPostRequest = (\n    DeviceNetworkEvents\n    | where Timestamp >= ago(timeframe)\n    | where ActionType == \"HttpConnectionInspected\"\n    | extend AdditionalFields_info = parse_json(AdditionalFields)\n    | where AdditionalFields_info.method == \"POST\"\n    and AdditionalFields_info.uri in (\"/api/connectivity\", \"/api/session\", \"/api/connect\")\n);\n// Detection 3: Process commands events Linked to CleanUpLoader\nlet ProcessCommandsEvents = (\n    DeviceProcessEvents\n    | where Timestamp >= ago(timeframe)\n    | where (  (ProcessCommandLine has_all (\"rundll32.exe\", \"%s\", \"Test\"))\n            or (ProcessCommandLine contains \"rundll32.exe\" and ProcessCommandLine has_any (\"CleanUp.dll\", \"CleanUp30.dll\"))\n            or (ProcessCommandLine has_all (\"schtasks.exe\", \"/create\", \"ClearMngs\", \"rundll32\", \".dll\", \"Test\"))\n            or (ProcessCommandLine has_all (\"powershell.exe\", \"schtasks.exe\", \"CreateShortcut\", \".lnk\", \"rundll32\", \".dll\", \"Test\"))\n        )\n);\n// Detection 4: File creation events Linked to CleanUpLoader\nlet FileCreationEvents = (\n    DeviceFileEvents\n    | where Timestamp >= ago(timeframe)\n    | where ActionType == \"FileCreated\"\n    | where FileName in (\"CleanUp.dll\", \"CleanUp30.dll\") and FolderPath has_any (\"\\\\Temp\\\\\")\n);\n// Combine all detections\nlet Suspicious_OysterBackdoorActivities = (\n    union ValidDigitalCertificates, C2HttpPostRequest, ProcessCommandsEvents, FileCreationEvents\n    | summarize arg_max(Timestamp, *) by DeviceId\n    | order by Timestamp asc\n);Suspicious_OysterBackdoorActivities",
      "external_references": [
        {
          "source_name": "KQL",
          "url": "https://github.com/CTI-Driven/Advanced-Threat-Hunting-Ransomware-Groups/tree/main/Arsenals/CleanUpLoader/kql"
        }
      ]
    },
    {
      "id": "course-of-action--dadd0fa6-cb8d-46e1-affb-76bbb20e6286",
      "type": "course-of-action",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
      "external_references": [
        {
          "source_name": "Sigma",
          "url": "https://github.com/CTI-Driven/Advanced-Threat-Hunting-Ransomware-Groups/tree/main/Arsenals/CleanUpLoader/sigma"
        }
      ],
      "name": "SIGMA",
      "description": "title: Detect DLL File Creation Events Linked to CleanUpLoader\nid: 87654321-4321-8765-4321-876543218765\nstatus: experimental\ndescription: Detects the creation of specific DLL files in Temp or Downloads folders, potentially linked to CleanUpLoader(Oyster Backdoor) activity.\nreferences:\n    - https://www.reliaquest.com/blog/5-malware-variants-you-should-know/\n    - https://go.recordedfuture.com/hubfs/reports/cta-2024-1009.pdf\n    - https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/\n    - https://app.any.run/tasks/aa15e125-38b8-44d8-add9-54e21e6813bb\nauthor: Nounou Mbeiri\ndate: 2024/10/15\ntags:\n    - attack.discovery\n    - attack.command_and_control\n    - attack.exfiltration\n    - attack.t1040\n    - attack.t1041\n    - attack.t1071\nlogsource:\n    product: windows\n    category: file_event\ndetection:\n  selection:\n    TargetFilename|endswith:\n      - 'CleanUp.dll'\n      - 'CleanUp30.dll'\n    TargetFilename|contains:\n      - '\\Temp\\'\n      - '\\Downloads'\n  condition: selection\nfalsepositives:\n  - Legitimate software installations or updates that use these CleanUp.dll\nlevel: medium\n\n-----------------------------\n\ntitle: Detect Rundll32 and Schtasks Command Events Linked to CleanUpLoader\nid: 12345678-1234-5678-1234-567812345678\nstatus: experimental\ndescription: Detects process creation events involving rundll32.exe and schtasks.exe commands associated with CleanUpLoader(Oyster Backdoor) activity on Windows systems.\nreferences:\n    - https://www.reliaquest.com/blog/5-malware-variants-you-should-know/\n    - https://go.recordedfuture.com/hubfs/reports/cta-2024-1009.pdf\n    - https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/\n    - https://app.any.run/tasks/aa15e125-38b8-44d8-add9-54e21e6813bb\nauthor: Nounou Mbeiri\ndate: 2024/10/15\ntags:\n    - attack.discovery\n    - attack.command_and_control\n    - attack.exfiltration\n    - attack.t1040\n    - attack.t1041\n    - attack.t1071\nlogsource:\n    product: windows\n    category: process_creation\ndetection:\n  selection1:\n    CommandLine|contains|all:\n      - 'rundll32.exe'\n      - '%s'\n      - 'Test'\n  selection2:\n    CommandLine|contains:\n      - 'rundll32.exe'\n  selection21:\n    CommandLine|contains:\n      - 'CleanUp.dll'\n      - 'CleanUp30.dll'\n  selection3:\n    CommandLine|contains|all:\n      - 'schtasks.exe'\n      - '/create'\n      - 'ClearMngs'\n      - 'rundll32'\n      - '.dll'\n      - 'Test'\n  selection4:\n    CommandLine|contains|all:\n      - 'powershell.exe'\n      - 'schtasks.exe'\n      - 'CreateShortcut'\n      - '.lnk'\n      - 'rundll32'\n      - '.dll'\n      - 'Test'\n  condition: selection1 or (selection2 and selection21)  or selection3 or selection4\nfalsepositives:\n  - Scripts or automation tools that include similar command patterns\nlevel: high"
    },
    {
      "id": "course-of-action--a7d0f3eb-f697-4f77-852f-b49cf8705fd8",
      "type": "course-of-action",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "name": "Recommendations",
      "description": "\n    To prevent users visiting typo-squatted domains used in Oyster campaigns, implement a DNS filtering service to detect and block such domains from users’ web browsing activity. Typo-squatting involves the creation of malicious websites with addresses that are similar to legitimate ones, often relying on common typing errors made by users. By employing a DNS filtering service, you can prevent users from inadvertently visiting these harmful sites. This protective measure helps to mitigate the risk of downloading malware and other malicious payloads, such as Oyster.\n\n    The Oyster loader executes directly from the temp folder (\\Local\\Temp\\) using an executable file (.exe) and a dynamic link library file (.dll). If feasible for your business, adding a restriction to block file execution from the temp folder can prevent Oyster and other malware from running, as this path is frequently exploited. However, this restriction might mean that it is not possible to install legitimate software, when there is a business need to do so, if it uses the same path as the frequently exploited one.\n\nVerify Software Installers:\nAlways verify the authenticity of software installers by checking digital signatures and downloading software only from trusted sources. CleanUpLoader often masquerades as legitimate software like Microsoft Teams\n"
    },
    {
      "id": "campaign--c4b09e21-b16b-428d-9739-5bd961803e42",
      "type": "campaign",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.threatdown.com/blog/rhysida-using-oyster-backdoor-to-deliver-ransomware/"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "name": "Oyster campaign",
      "description": "Oyster campaign first discovered by Rapid7 in late June 2024 that uses SEO-poisoned search results to trick users into downloading malicious installers. These installers masquerade as legitimate software, such as Google Chrome and Microsoft Teams, but instead drop the Oyster backdoor.  ",
      "aliases": [],
      "first_seen": "2024-10-13T13:25:24+01:00",
      "last_seen": "2024-10-13T13:25:24+01:00",
      "objective": ""
    },
    {
      "id": "attack-pattern--9f2e6ab4-4a39-4f84-ad68-f4029f713fca",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://attack.mitre.org/techniques/T1053/005/"
        }
      ],

      "name": "Persistence - T1053.005 : Scheduled Task ",
      "description": "The Oyster/CleanUpLoader malware leverages T1053.005 - Scheduled Task/Job: Scheduled Task as a key method to establish persistence on compromised systems. Specifically, after the malware is executed, it creates a scheduled task that automatically runs malicious components at regular intervals, ensuring that the backdoor remains active over time.",
      "kill_chain_phases": []
    },
    {
      "id": "attack-pattern--db9269b2-63c6-4fd0-a371-80cbef457af0",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/"
        }
      ],

      "name": "Command and Control - T1071.001: Application Layer Protocol - Web Protocols",
      "description": "The backdoor communicates with Command-and-Control (C2) servers using standard HTTP/HTTPS protocols, which helps evade detection by blending in with normal web traffic​.",
      "kill_chain_phases": []
    },
    {
      "id": "attack-pattern--2c2d9977-af4d-42a8-9e39-86b2ae94a092",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/"
        }
      ],

      "name": "Defense Evasion - T1140: Deobfuscate/Decode Files or Information",
      "description": "The malware uses obfuscation techniques to hide its code and evade detection during its operation​.",
      "kill_chain_phases": []
    },
    {
      "id": "attack-pattern--9d35ba7d-be71-4aa5-b696-720fbbbabad7",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/"
        }
      ],

      "name": "Exfiltration - T1041: Exfiltration Over C2 Channel",
      "description": "The backdoor exfiltrates sensitive data over the same C2 channel it uses for communication, making it harder to detect.",
      "kill_chain_phases": []
    },
    {
      "id": "threat-actor--d3149b9f-ee51-46f8-b29b-efa3d7040103",
      "type": "threat-actor",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://app.tidalcyber.com/groups/0b431229-036f-4157-a1da-ff16dfc095f8"
        }
      ],
      "object_marking_refs": [],
      "granular_markings": [],
      "threat_actor_types": [],
      "name": " Wizard Spider",
      "description": "Wizard Spider is a Russia-based financially motivated threat group originally known for the creation and deployment of TrickBot since at least 2016. Wizard Spider possesses a diverse aresenal of tools and has conducted ransomware campaigns against a variety of organizations, ranging from major corporations to hospitals.[CrowdStrike Ryuk January 2019][DHS/CISA Ransomware Targeting Healthcare October 2020][CrowdStrike Wizard Spider October 2020]",
      "aliases": [],
      "roles": [],
      "goals": [
        "Financial Gain"
      ],
      "first_seen": "2024-10-13T13:25:24+01:00",
      "last_seen": "2024-10-13T13:25:24+01:00",
      "sophistication": "advanced",
      "resource_level": "",
      "primary_motivation": "",
      "secondary_motivations": [],
      "personal_motivations": []
    },
    {
      "id": "attack-pattern--fd59d102-3877-4ba7-ab7c-03c2aa616c91",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.reliaquest.com/blog/5-malware-variants-you-should-know/"
        }
      ],

      "name": " Initial Access  - T1583.008:  Malvertising",
      "description": "Attackers create fake websites that appear to offer legitimate software downloads (e.g., Microsoft Teams), tricking users into downloading malware​",
      "kill_chain_phases": []
    },
    {
      "id": "attack-pattern--bbff72f2-4862-4376-820a-0e5328c997b9",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.reliaquest.com/blog/5-malware-variants-you-should-know/"
        }
      ],

      "name": "Discovery - T1057: Process Discovery",
      "description": "Discovery - TT1057: Process Discovery: commands intended to gather information of the compromised host and domain environment were executed, including “whoami.exe,” “net1 group ‘domain computers’ /domain,” “nltest.exe /domain_trusts,” and “ tasklist.exe.”",
      "kill_chain_phases": []
    },
    {
      "id": "attack-pattern--94300afc-1eea-4522-9226-73d573269ae3",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.reliaquest.com/blog/5-malware-variants-you-should-know/"
        }
      ],

      "name": "Discovery - T1007: System Service Discovery ",
      "description": "Discovery - T1007: System Service Discovery: commands intended to gather information of the compromised host and domain environment were executed, including “whoami.exe,” “net1 group ‘domain computers’ /domain,” “nltest.exe /domain_trusts,” and “ tasklist.exe.”",
      "kill_chain_phases": []
    },
    {
      "id": "attack-pattern--4d56837d-c7e5-4149-af52-a011ece2aa40",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.reliaquest.com/blog/5-malware-variants-you-should-know/"
        }
      ],

      "name": "Discovery - T1482: Domain Trust Discovery ",
      "description": "Discovery - T1482: Domain Trust Discovery:  commands intended to gather information of the compromised host and domain environment were executed, including “whoami.exe,” “net1 group ‘domain computers’ /domain,” “nltest.exe /domain_trusts,” and “ tasklist.exe.”",
      "kill_chain_phases": []
    },
    {
      "id": "attack-pattern--6c38d921-e8fe-4866-a2ca-80bdda4c2eab",
      "type": "attack-pattern",
      "spec_version": 2.1,
      "created": "2024-10-13T13:25:24+01:00",
      "modified": "2024-10-13T13:25:24+01:00",
 
      "external_references": [
        {
          "source_name": "",
          "url": "https://www.reliaquest.com/blog/5-malware-variants-you-should-know/"
        }
      ],

      "name": "Discovery - T1069.002: Domain Groups",
      "description": "Discovery - T1069.002: Domain Groups: commands intended to gather information of the compromised host and domain environment were executed, including “whoami.exe,” “net1 group ‘domain computers’ /domain,” “nltest.exe /domain_trusts,” and “ tasklist.exe.”",
      "kill_chain_phases": []
    },
    {
      "source_ref": "indicator--6a9dbe65-b8fb-44c2-9844-97540c9168d2",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "indicates",
      "type": "relationship",
      "created": "2024-10-13T12:51:40.548Z",
      "modified": "2024-10-13T12:51:40.548Z",
      "id": "relationship--d59e5d76-cd9a-404d-bb1d-3daf1ff8b6e5",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "course-of-action--80412f82-96ff-4597-bffc-64a16a115244",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "mitigates",
      "type": "relationship",
      "created": "2024-10-13T12:58:38.102Z",
      "modified": "2024-10-13T12:58:38.102Z",
      "id": "relationship--ae9ddb61-e64a-4529-b7c7-ca6173caa02f",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "course-of-action--d135ec7d-053e-47e2-8ff1-6ac39b4c2f08",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "mitigates",
      "type": "relationship",
      "created": "2024-10-13T13:00:58.011Z",
      "modified": "2024-10-13T13:00:58.011Z",
      "id": "relationship--69bace96-62b1-473d-a43c-a84f60eeeb01",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "course-of-action--dadd0fa6-cb8d-46e1-affb-76bbb20e6286",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "mitigates",
      "type": "relationship",
      "created": "2024-10-13T13:03:32.781Z",
      "modified": "2024-10-13T13:03:32.781Z",
      "id": "relationship--864b7e7b-80ca-4c9a-93a1-9be5004dce80",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "course-of-action--a7d0f3eb-f697-4f77-852f-b49cf8705fd8",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "mitigates",
      "type": "relationship",
      "created": "2024-10-13T13:04:36.733Z",
      "modified": "2024-10-13T13:04:36.733Z",
      "id": "relationship--00b51181-26bd-4b3a-946b-caddeb8a8dcd",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "campaign--c4b09e21-b16b-428d-9739-5bd961803e42",
      "target_ref": "attack-pattern--fd59d102-3877-4ba7-ab7c-03c2aa616c91",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T15:35:34.366Z",
      "modified": "2024-10-14T15:35:34.366Z",
      "id": "relationship--a7f24c4f-c05b-48ee-91dc-b97dcca04a51",
      "targetObjectType": "attack-pattern,"
    },
    {
      "source_ref": "attack-pattern--9f2e6ab4-4a39-4f84-ad68-f4029f713fca",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T17:12:16.469Z",
      "modified": "2024-10-14T17:12:16.469Z",
      "id": "relationship--2f17bc05-07bb-4501-8c46-312615c1052d",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "attack-pattern--db9269b2-63c6-4fd0-a371-80cbef457af0",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T17:34:10.487Z",
      "modified": "2024-10-14T17:34:10.487Z",
      "id": "relationship--d4518df0-1e58-4797-a678-86c3b5897f99",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "attack-pattern--2c2d9977-af4d-42a8-9e39-86b2ae94a092",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T17:35:40.643Z",
      "modified": "2024-10-14T17:35:40.643Z",
      "id": "relationship--c2cbbaa7-0494-4ba2-a78a-cebd477f85a7",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "attack-pattern--9d35ba7d-be71-4aa5-b696-720fbbbabad7",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T17:37:19.011Z",
      "modified": "2024-10-14T17:37:19.011Z",
      "id": "relationship--ee9d1181-49e1-4e7e-a959-97a83e19d135",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "threat-actor--36924446-8ac0-47a3-a618-29e0aa134148",
      "target_ref": "attack-pattern--fd59d102-3877-4ba7-ab7c-03c2aa616c91",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T18:02:36.797Z",
      "modified": "2024-10-14T18:02:36.797Z",
      "id": "relationship--5df99330-6d76-4755-abdb-edf05332b0c4",
      "targetObjectType": "attack-pattern"
    },
    {
      "source_ref": "threat-actor--d3149b9f-ee51-46f8-b29b-efa3d7040103",
      "target_ref": "attack-pattern--fd59d102-3877-4ba7-ab7c-03c2aa616c91",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T18:02:42.028Z",
      "modified": "2024-10-14T18:02:42.028Z",
      "id": "relationship--94eec3d9-0e43-4f40-a8c3-0e07f2c55716",
      "targetObjectType": "attack-pattern"
    },
    {
      "source_ref": "attack-pattern--fd59d102-3877-4ba7-ab7c-03c2aa616c91",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "delivers",
      "type": "relationship",
      "created": "2024-10-14T18:03:15.557Z",
      "modified": "2024-10-14T18:03:15.557Z",
      "id": "relationship--c628ddbd-3b7b-486f-b32a-89629d2fb61e",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "attack-pattern--bbff72f2-4862-4376-820a-0e5328c997b9",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T18:22:15.219Z",
      "modified": "2024-10-14T18:22:15.219Z",
      "id": "relationship--5047c5fc-3d1e-4880-a15b-380d977e57ac",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "attack-pattern--94300afc-1eea-4522-9226-73d573269ae3",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T18:25:35.663Z",
      "modified": "2024-10-14T18:25:35.663Z",
      "id": "relationship--31e0437d-381f-4432-9f3d-dd108c09150d",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "attack-pattern--4d56837d-c7e5-4149-af52-a011ece2aa40",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T18:35:08.007Z",
      "modified": "2024-10-14T18:35:08.007Z",
      "id": "relationship--b3808754-66c1-4a62-b33b-a4b1f4b74984",
      "targetObjectType": "malware"
    },
    {
      "source_ref": "attack-pattern--6c38d921-e8fe-4866-a2ca-80bdda4c2eab",
      "target_ref": "malware--edd99695-8766-44d7-9de5-9b1451de0f8a",
      "relationship_type": "uses",
      "type": "relationship",
      "created": "2024-10-14T18:36:05.279Z",
      "modified": "2024-10-14T18:36:05.279Z",
      "id": "relationship--81eca315-e90a-4f41-bc5c-9ac40584be7a",
      "targetObjectType": "malware"
    }
  ]
}
