title: Detect Rundll32 and Schtasks Command Events Linked to CleanUpLoader
id: 12345678-1234-5678-1234-567812345678
status: experimental
description: Detects process creation events involving rundll32.exe and schtasks.exe commands associated with CleanUpLoader(Oyster Backdoor) activity on Windows systems.
references:
    - https://www.reliaquest.com/blog/5-malware-variants-you-should-know/
    - https://go.recordedfuture.com/hubfs/reports/cta-2024-1009.pdf
    - https://www.rapid7.com/blog/post/2024/06/17/malvertising-campaign-leads-to-execution-of-oyster-backdoor/
    - https://app.any.run/tasks/aa15e125-38b8-44d8-add9-54e21e6813bb
author: Nounou Mbeiri
date: 2024/10/15
tags:
    - attack.discovery
    - attack.command_and_control
    - attack.exfiltration
    - attack.t1040
    - attack.t1041
    - attack.t1071
logsource:
    product: windows
    category: process_creation
detection:
  selection1:
    CommandLine|contains|all:
      - 'rundll32.exe'
      - '%s'
      - 'Test'
  selection2:
    CommandLine|contains:
      - 'rundll32.exe'
  selection21:
    CommandLine|contains:
      - 'CleanUp.dll'
      - 'CleanUp30.dll'
  selection3:
    CommandLine|contains|all:
      - 'schtasks.exe'
      - '/create'
      - 'ClearMngs'
      - 'rundll32'
      - '.dll'
      - 'Test'
  selection4:
    CommandLine|contains|all:
      - 'powershell.exe'
      - 'schtasks.exe'
      - 'CreateShortcut'
      - '.lnk'
      - 'rundll32'
      - '.dll'
      - 'Test'
  condition: selection1 or (selection2 and selection21)  or selection3 or selection4
falsepositives:
  - Scripts or automation tools that include similar command patterns
level: high